Identifier: com.llamafilm.munki.grafana_alloy
MinimumVersion: 2.3.0
ParentRecipe: com.llamafilm.pkg.grafana_alloy

Input:
  NAME: grafana_alloy
  MUNKI_REPO_SUBDIR: apps
  ALLOY_CONFIG: |
    local.file "local_context" {
      filename = "/Library/GrafanaAlloy/local_context.json"
    }
  GCLOUD_RW_API_KEY: ''
  ARCH: arm64
  SUPPORTED_ARCH: arm64
  pkginfo:
    blocking_applications: []
    catalogs:
    - testing
    - stable
    category: Engineering
    description: Grafana Alloy agent for collecting metrics and logs. Configure using Grafana Cloud Fleet Management.
    developer: Grafana
    display_name: Grafana Alloy
    minimum_os_version: 10.13
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
    preuninstall_script: |
      #!/bin/bash
      launchctl unload -w "/Library/LaunchDaemons/com.grafana.alloy.plist" 2>/dev/null
      exit 0

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/grafana_alloy-%version%-%ARCH%.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
