Description: Package the latest version of XAMPP
Identifier: com.llamafilm.munki.xampp
MinimumVersion: 2.3.0
ParentRecipe: com.llamafilm.pkg.xampp

Input:
  NAME: XAMPP
  MUNKI_REPO_SUBDIR: apps
  pkginfo:
    blocking_applications:
    - manager-osx.app
    catalogs:
    - testing
    category: Engineering
    description: An easy to install Apache distribution containing MariaDB, PHP, and Perl. 
    developer: Apache Friends
    display_name: XAMPP
    icon_name: XAMPP
    name: '%NAME%'
    postinstall_script: |
      #!/bin/sh
      launchctl bootstrap system /Library/LaunchDaemons/org.apachefriends.xampp.apache.plist || true
      launchctl bootstrap system /Library/LaunchDaemons/org.apachefriends.xampp.mysql.plist || true
    postuninstall_script: |
      #!/bin/sh
      rm -rf /Applications/XAMPP
    preinstall_script: |
      #!/bin/sh
      launchctl bootout system /Library/LaunchDaemons/org.apachefriends.xampp.apache.plist 2>/dev/null || true
      launchctl bootout system /Library/LaunchDaemons/org.apachefriends.xampp.mysql.plist 2>/dev/null || true
    preuninstall_script: |
      #!/bin/sh
      launchctl bootout system /Library/LaunchDaemons/org.apachefriends.xampp.apache.plist 2>/dev/null || true
      launchctl bootout system /Library/LaunchDaemons/org.apachefriends.xampp.mysql.plist 2>/dev/null || true
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/xampp-%version%.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
